app/views/coordinators/registrations/new.html.erb

    <%= f.label :course %>
    <%= f.collection_select(:course_id, Course.all, :id, :nome)%>
---
SELECT `courses`.* FROM `courses`