app/views/students/show.html.erb

SELECT `contacts`.* FROM `contacts` WHERE `contacts`.`student_id` = 5
---
  <strong>Contatos:</strong><br><br>
  <% @student.contacts.each do |contact| %>