app/views/coordinators/_home.html.erb

SELECT `students`.* FROM `students`
---
  <tbody>
    <% Student.all.each do |student| %>

SELECT `briefs`.* FROM `briefs`
---
  <tbody>
    <% Brief.all.each do |brief| %>