app/controllers/briefs_controller.rb

SELECT `briefs`.* FROM `briefs`
---
  def index
    @briefs = Brief.all.page(
      params[:page]).per(5)

INSERT INTO `briefs` (`texto`, `student_id`, `created_at`, `updated_at`, `homologado`) VALUES ('Neque porro quisquam est qui dolorem ipsum quia dolor sit amet, consectetur, adipisci velit...', 6, '2018-07-26 16:45:14', '2018-07-26 16:45:14', 0)
---
  def create
    @brief = Brief.new(brief_params)
    @brief.student_id = current_student.id
    respond_to do |format|
      if @brief.save

UPDATE `briefs` SET `homologado` = 1, `updated_at` = '2018-07-26 16:51:39' WHERE `briefs`.`id` = 1
---
  def update
    respond_to do |format|
      if @brief.update(brief_params)

SELECT  `briefs`.* FROM `briefs` WHERE `briefs`.`id` = 1 LIMIT 1
---
    def set_brief
      @brief = Brief.find(params[:id])