app/controllers/conclusions_controller.rb

INSERT INTO `conclusions` (`ano`, `semestre`, `created_at`, `updated_at`) VALUES ('2018', '2', '2018-07-19 17:05:51', '2018-07-19 17:05:51')
---
  def create
    @conclusion = Conclusion.new(conclusion_params)

    respond_to do |format|
      if @conclusion.save

SELECT  `conclusions`.* FROM `conclusions` WHERE `conclusions`.`id` = 1 LIMIT 1
---
    def set_conclusion
      @conclusion = Conclusion.find(params[:id])