app/controllers/contacts_controller.rb

  def destroy
    @contact.destroy
---
DELETE FROM `contacts` WHERE `contacts`.`id` = 1

    def set_contact
      @contact = Contact.find(params[:id])
---
SELECT  `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 1 LIMIT 1