app/controllers/coordinators_controller.rb

SELECT `coordinators`.* FROM `coordinators`
---
  def index
    @coordinators = Coordinator.all

DELETE FROM `coordinators` WHERE `coordinators`.`id` = 1
---
  def destroy
    @coordinator.destroy

SELECT  `coordinators`.* FROM `coordinators` WHERE `coordinators`.`id` = 1 LIMIT 1
---
    def set_coordinator
      @coordinator = Coordinator.find(params[:id])