app/controllers/courses_controller.rb

INSERT INTO `courses` (`nome`, `abreviacao`, `site`, `modalidade`, `email`, `created_at`, `updated_at`) VALUES ('Sistemas para Internet', 'SI', 'si.ifpb.edu.br', 'Presencial', 'si@ifpb.edu.br', '2018-07-19 14:38:30', '2018-07-19 14:38:30')
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
---
    def set_course
      @course = Course.find(params[:id])