app/controllers/students_controller.rb

  def index
    @students = Student.all
---
SELECT  `students`.* FROM `students` ORDER BY `students`.`id` ASC LIMIT 1

  def update
    @student.homologado = "1"
    @student.save
---
UPDATE `students` SET `homologado` = 1, `updated_at` = '2018-07-25 14:19:51' WHERE `students`.`id` = 1

  def destroy
    @student.destroy
---
DELETE FROM `students` WHERE `students`.`id` = 2

    def set_student
      @student = Student.find(params[:id])
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1