app/views/students/registrations/new.html.erb

    <%= f.label :course %>
    <%= f.collection_select(:course_id, Course.all, :id, :nome)%>
---
SELECT `courses`.* FROM `courses`

    <%= f.label :conclusion %>
    <%= f.collection_select(:conclusion_id, Conclusion.all, :id, :nome)%>
---
SELECT `conclusions`.* FROM `conclusions`